Documents/АктСписанияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>АктСписанияТМЦ</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТМЦ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПосле</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЦеныТоваров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРеквизитов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараПродажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараВозвратная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктСписанияТМЦ/Ext/ObjectModule.bsl
Процедура ЗаполнитьТовары(Коллекция, Склад, ТипТовара, Дата, Обновление = Ложь) Экспорт
	Таблица = Коллекция.Выгрузить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РегОстатки.Товар КАК Товар,
	|	РегОстатки.КоличествоОстаток КАК Остаток,
	|	ИсторияРеквизитовСтавкаНДС.Значение КАК СтавкаНДС,
	|	ВЫБОР КОГДА РегОстатки.КоличествоОстаток <> 0 ТОГДА (РегОстатки.СуммаОстаток / РегОстатки.КоличествоОстаток) ИНАЧЕ РегЦенаБазовая.Цена КОНЕЦ КАК ЦенаБазовая
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&Дата, Склад = &Склад И Порожняя = Ложь И Бронь = Ложь) КАК РегОстатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних(&Дата, Тип = ""ЦенаБазовая"") КАК РегЦенаБазовая ПО РегЦенаБазовая.Товар.Ссылка = РегОстатки.Товар.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРеквизитов.СрезПоследних(&Дата, Реквизит = ""СтавкаНДС"") КАК ИсторияРеквизитовСтавкаНДС ПО ИсторияРеквизитовСтавкаНДС.Ссылка.Ссылка = РегОстатки.Товар.Ссылка
	|ГДЕ
	|	РегОстатки.КоличествоОстаток <> 0 И (РегОстатки.Товар.ВидТовара.ТипТовара В (&ТипТовара))");
	
	Если Обновление Тогда
		Запрос.Текст = Запрос.Текст + " И РегОстатки.Товар В (&МассивТоваров)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	РегОстатки.Товар.Наименование";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТипТовара", ТипТовара);
	
	Если Обновление Тогда
		Запрос.УстановитьПараметр("МассивТоваров", Таблица.ВыгрузитьКолонку("Товар"));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Для Каждого Строка из Таблица Цикл
		Строка.ОстатокДо = 0;
	КонецЦикла;

	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаТовар.Следующий() Цикл
		ТекущиеСтроки = Таблица.НайтиСтроки(Новый Структура("Товар", ВыборкаТовар.Товар));
		
		Если ТекущиеСтроки.Количество() = 0 И Обновление = Ложь Тогда
			Строка = Таблица.Добавить();
			Строка.Товар = ВыборкаТовар.Товар;
			
			ТекущиеСтроки = Таблица.НайтиСтроки(Новый Структура("Товар", ВыборкаТовар.Товар));
		КонецЕсли;
		
		Остаток = ВыборкаТовар.Остаток;
		
		Для Каждого Строка Из ТекущиеСтроки Цикл
			Если Таблица.Колонки.Найти("ОстатокДо") <> Неопределено Тогда
				Строка.ОстатокДо = Остаток;
			КонецЕсли;
			
			Если Таблица.Колонки.Найти("ОстатокПосле") <> Неопределено Тогда
				Строка.ОстатокПосле = Остаток - Строка.Количество;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.СтавкаНДС) = Ложь Тогда
				Строка.СтавкаНДС = ВыборкаТовар.СтавкаНДС;
			КонецЕсли;
			
			Строка.ЦенаБазовая = ВыборкаТовар.ЦенаБазовая;
			
			Строка.СуммаБазовая = Строка.ЦенаБазовая * Строка.Количество;
			Строка.СуммаНДС = АрифметическиеФункции.РассчитатьНаценку(Строка.СуммаБазовая, Строка.СтавкаНДС);
			Строка.СуммаСНДС = Строка.ЦенаСНДС * Строка.Количество;
					
			Строка.Объем = Строка.Количество * ВыборкаТовар.Товар.Объем;
			Строка.Вес = Строка.Количество * ВыборкаТовар.Товар.Вес;
			
			Остаток = Остаток - Строка.Количество;
		КонецЦикла;
	КонецЦикла;
	
	Если (НЕ Обновление) Тогда
		Таблица.Сортировать("Товар");
	КонецЕсли;
	
	Коллекция.Загрузить(Таблица);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Неопределено") ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Склад = ПараметрыСеанса.Пользователь.Склад;
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТМЦ") Тогда
		// Заполнение шапки
		Автор = ДанныеЗаполнения.Автор;
		Источник = ДанныеЗаполнения.Источник;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		Сумма = ДанныеЗаполнения.Сумма;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Вес = ТекСтрокаТовары.Вес;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Объем = ТекСтрокаТовары.Объем;
			НоваяСтрока.ОстатокДо = ТекСтрокаТовары.ОстатокДо;
			НоваяСтрока.ОстатокПосле = ТекСтрокаТовары.ОстатокПосле;
			НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
			НоваяСтрока.СуммаБазовая = ТекСтрокаТовары.СуммаБазовая;
			НоваяСтрока.СуммаНДС = ТекСтрокаТовары.СуммаНДС;
			НоваяСтрока.СуммаСНДС = ТекСтрокаТовары.СуммаСНДС;
			НоваяСтрока.Товар = ТекСтрокаТовары.Товар;
			НоваяСтрока.ЦенаБазовая = ТекСтрокаТовары.ЦенаБазовая;
			НоваяСтрока.ЦенаСНДС = ТекСтрокаТовары.ЦенаСНДС;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Остатки Расход
	Движения.Остатки.Записывать = Истина;
	
	Для Каждого Строка Из Товары Цикл
		Если Строка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Контроль текущих остатков товара
		Если Склад.КонтрольОстатков И ПривилегированныйРежим() = Ложь Тогда
			Если (Строка.ОстатокДо - Строка.Количество) < 0 Тогда
				Сообщить("Недостаточно товаров на складе: " + Строка.НомерСтроки + ". " + Строка.Товар.Наименование + " (" + Строка.Товар.Код + ")", СтатусСообщения.ОченьВажное);
				
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		// Расход товара
		Если Склад.НеВестиУчет = Ложь Тогда
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Товар = Строка.Товар;
			Движение.Порожняя = Ложь;
			Движение.Примечание = глНайтиПримечания(Комментарий);
			Движение.Количество = Строка.Количество;
			Движение.Сумма = Строка.Количество * Строка.ЦенаБазовая;
			
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Склад = Склад.Накопитель;
			Движение.Товар = Строка.Товар;
			Движение.Порожняя = Ложь;
			Движение.Примечание = глНайтиПримечания(Комментарий);
			Движение.Количество = Строка.Количество;
			Движение.Сумма = Строка.Количество * Строка.ЦенаБазовая;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		УчетнаяПолитика = УчетныеПолитики.ПолучитьНаДату(Дата, Организация);
		
		Для Каждого Строка Из Товары Цикл
			Если Строка.СуммаБазовая = 0 Тогда
				Строка.СуммаБазовая = Строка.ЦенаБазовая * Строка.Количество;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.СтавкаНДС) = Ложь Тогда
				Строка.СтавкаНДС = УчетнаяПолитика.СтавкаНДС;
			КонецЕсли;
			Если Строка.ЦенаСНДС = 0 Тогда
				Строка.ЦенаСНДС = АрифметическиеФункции.ДобавитьНаценку(Строка.ЦенаБазовая, Строка.СтавкаНДС);
			КонецЕсли;
			Если Строка.СуммаСНДС = 0 Тогда
				Строка.СуммаСНДС = Строка.ЦенаСНДС * Строка.Количество;
			КонецЕсли;
		КонецЦикла;
		
		// Корректировка данных
		Если Константы.Реализация_ПересчетОстатковПриПроведенииДокумента.Получить() Тогда
			Момент = ОбщийМодульСервер.ПолучитьМоментВремениДокумента(ЭтотОбъект);
			ЗаполнитьТовары(Товары, Склад, Перечисления.ТипыТовара.Товар, Момент, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Сумма = Товары.Итог("СуммаБазовая");
КонецПроцедуры
